#include <stdio.h>
#include <math.h>
#include <locale.h>
#include <windows.h>

int main() {
	setlocale(LC_ALL, "ukr");

	SetConsoleOutputCP(CP_UTF8);
	SetConsoleCP(CP_UTF8);

	/*
	for (int i = 0; i < 10; i++) printf("Ітерація №%d\n", i);

	int j = 10;
	for (; j >= 0; --j) printf("j = %d\t", j);

	int n = 0, sum = 0;
	printf("\nВведіть натуральне число: ");
	scanf_s("%d", &n);

	for (int i = 1; i <= n; i++) sum += i;

	printf("Сума всіх натуральних чисел до %d дорівнює %d\n", n, sum);

	int a = 0, f = 1;
	printf("\nВведіть число для обчислення факторіала: ");
	scanf_s("%d", &a);

	for (int i = 1; i <= a; i++) f *= i;

	printf("Факторіал числа %d дорівнює %d\n", a, f);*/

	// Самойстійна робота

	printf("\tЗавдання 3. Пошук коренів квадратичного рівняння\n");

	for (int x = -100; x < 101; x++)
	{
		if ((pow(x, 2) - (5 * x) + 6) == 0)
		{
			printf("Перший корінь рівняння x^2 - 5x + 6 = 0 на проміжку від -100 до 100 дорівнює x = %d", x);
			break;
		}
	}

	printf("\n\n\tЗавдання 4. Обчислення периметра правильного багатокутника\n");

	int n4 = 0, a4 = 0;

	printf("Введіть кількість сторін багатокутника: ");
	scanf_s("%d", &n4);
	if (n4 < 3)
	{
		printf("Багатокутник повинен мати більше 2 сторін");
		goto end_task4;
	}
	printf("Введіть довжину сторони багатокутника: ");
	scanf_s("%d", &a4);
	printf("Периметр правильного багатокутника дорівнює %d", n4 * a4);

	end_task4:
	printf("\n\n\tЗавдання 9. Обчислення кута трикутника за косинусом\n");

	int a9 = 0, b9 = 0, c9 = 0;

	printf("Введіть довжину стороін трикутника: ");
	scanf_s("%d %d %d", &a9, &b9, &c9);
	printf("Косинус кута проти сторони а дорівнює %.2f", ((pow(a9, 2) + pow(b9, 2) - pow(c9, 2)) / (2 * a9 * b9)));

	printf("\n\n\tЗавдання 11. Розв'язання рівняння на відрізку\n");

	double x11 = 0.0, y11 = 0.0, step11 = 0.1;

	printf("Розв'язання рівняння x^2 - 4x - 7 = 0 на відрізку [-10; 10] з ходом 0.1\n");

	int found_root = 0;
	for (x11 = -10; x11 <= 10; x11 += step11) {
		y11 = x11 * x11 - 4 * x11 - 7;

		if (y11 > -0.01 && y11 < 0.01)
		{
			printf("Знайдено корінь рівняння: %.2f\n", x11);
			found_root = 1;
		}
	}

	if (found_root == 0) printf("Коренів рівняння x^2 - 4x - 7 = 0 на відрізку [-10; 10] з ходом 0.1 немає\n");

	printf("\n\tЗавдання 13. Наближення числа Пі за допомогою ряду Лейбніца\n");

	double pi = 0.0;
	int n13 = 100;

	for (int i = 0; i < 2 * n13; i++) {
		if (i % 2 == 0) continue;
		else pi += ((i % 4 == 1) ? 1.0 : -1.0) / i;
	}

	printf("Число Пі за допомогою ряду Лейбніца дорівнює %.5f", 4 * pi);

	printf("\n\n\tЗавдання 14. Розв'язок рівняння прямої\n");

	double x14 = 0.0, y14 = 0.0, step14 = 0.5, k14 = 2.5, b14 = 3.0;

	printf("Розв'язання рівняння y = kx + b на відрізку [-10; 10] з ходом 0.5 де k = %.2f, b = %.2f\n", k14, b14);
	for (x14 = -10.0; x14 <= 10.0; x14 += step14)
	{
		y14 = k14 * x14 + b14;

		if (y14 > 100 && y14 < -100)
		{
			printf("Значення y вийшло за межі [-100, 100]\n");
			break;
		}
		else printf("x = %.2f\ty = %.2f\n", x14, y14);
	}

	printf("\n\tЗавдання 15. Підрахунок кількості рішень\n");

	double x15 = 0.0, y15 = 0.0, step15 = 1.0, a15 = 1.0, b15 = -3.0, c15 = 2.0;
	int count_roots = 0;

	printf("Розв'язання рівняння ax^2 + bx + c = 0 на відрізку [-10; 10] з ходом 1 де a = %.1f, b = %.1f, c = %.1f\n", a15, b15, c15);
	for (x15 = -10.0; x15 <= 10.0; x15 += step15)
	{
		y15 = a15 * x15 * x15 + b15 * x15 + c15;

		if (y15 > -0.01 && y15 < 0.01)
		{
			count_roots++;
			printf("Знайдено корінь: x = %.1f\n", x15);
			if (count_roots >= 2) break; // Зупиняємося після 2 коренів (максимум для квадратичного рівняння)
		}
	}
	printf("Кількість знайдених коренів: %d", count_roots);

	printf("\n\n\tЗавдання 19. Рівнобічний трикутник\n");

	double b19 = 0.0, h19 = 0.0, area19 = 0.0;

	printf("Обчислення площі рівнобічного трикутника\n");
	printf("Введіть основу b: ");

	scanf_s("%lf", &b19);
	if (b19 < 0) goto end_triangle;

	printf("Введіть висоту h: ");
	scanf_s("%lf", &h19);
	if (h19 < 0) goto end_triangle;

	area19 = (b19 * h19) / 2.0;
	printf("Площа трикутника з основою %.2f та висотою %.2f = %.2f\n", b19, h19, area19);

	end_triangle:
	printf("Програма завершена\n");

	return 0;
}